E_SLS_64000101=This API can not execute. Please check details and modify it.
E_SLS_64000103=Unabled to get open log.
E_SLS_64000104=It is payoff complete data.
E_SLS_64000105=No data exists in trans store code master.
E_SLS_64000109=Payoff date is not defined.
E_SLS_64000110=Business date cannot update.
E_SLS_64000111=No data exists in store control.
E_SLS_64000146=Unchecked cash register exists.
E_SLS_66000128=No data exists in common code master.
I_SLS_06000108=Alteration data uploading process has been completed.
E_SLS_66000119=Please select the upload file.
E_SLS_66000120=Size of {0} file is over {1}, so it cannot upload.
E_SLS_66000121=Error of file format in transaction receiving process of {0}.
E_SLS_66000122=The uploaded file format is incorrect.
E_SLS_66000123=The selected file does not exist.
E_SLS_66000124=It becomes error in integrity check.
E_SLS_66000125=An error occurs in transaction receiving process of {0}, so it cannot upload.
E_SLS_66000126={0} payoff data import error occurs, so it cannot upload.
E_SLS_66000101=The same data with store/business date/cash register No. of target data are being revised by another user.
E_SLS_66000131=Data does not exist in store code conversion master.
E_SLS_66000134=The data does not exist in the business daily report management as the search condition.
I_SLS_06000111=Do you want to upload data?
E_SLS_66000131=No data exists in store code conversion master.
E_SLS_66000153=No data exists in non-item master.
E_SLS_66000170=No data exists in tender conversion master.
E_SLS_66000151=Size of specified scope is opposite.
E_SLS_66000134=No data corresponding to search condition.
E_SLS_66000162=No data exists in setting information by business/country/state.
E_SLS_66000145=It is already settled data.
E_SLS_66000147=An error occurred in the compensation adjustment data acquisition API.
I_SLS_06000109=Registration of correction adjustment data has been completed.


E_SLS_66000101 = \u5bfe\u8c61\u30c7\u30fc\u30bf\u306e\u5e97\u8217\uff0f\u55b6\u696d\u65e5\uff0f\u30ec\u30b8No\u3068\u540c\u3058\u30c7\u30fc\u30bf\u3092\u4ed6\u30e6\u30fc\u30b6\u304c\u88dc\u6b63\u4e2d\u3067\u3059\u3002
E_SLS_66000102 = \u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u5bfe\u8c61\u306e\u30c7\u30fc\u30bf\u30921\u4ef6\u4ee5\u4e0a\u9078\u629e\u3057\u3066\u4e0b\u3055\u3044\u3002
E_SLS_66000104 = \u524a\u9664\u5bfe\u8c61\u306e\u30c7\u30fc\u30bf\u30921\u4ef6\u4ee5\u4e0a\u9078\u629e\u3057\u3066\u4e0b\u3055\u3044\u3002
I_SLS_06000103 = \u30c7\u30fc\u30bf\u3092\u524a\u9664\u3057\u307e\u3059\u3002\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
E_SLS_66000105 = \u30c7\u30fc\u30bf\u524a\u9664\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
I_SLS_06000104 = \u30c7\u30fc\u30bf\u524a\u9664\u51e6\u7406\u3092\u5b9f\u884c\u3057\u307e\u3057\u305f\u3002
e.common.exception.business-error = \u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u53d6\u308a\u8fbc\u307fAPI 4XX business error.
E_SLS_66000106 = \u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u5bfe\u8c61\u306e\u30c7\u30fc\u30bf\u30921\u4ef6\u4ee5\u4e0a\u9078\u629e\u3057\u3066\u4e0b\u3055\u3044\u3002
I_SLS_06000105 = \u30c7\u30fc\u30bf\u306e\u518d\u53d6\u8fbc\u3092\u55b6\u696d\u65e5\u30c1\u30a7\u30c3\u30af\u306a\u3057\u3067\u884c\u3044\u307e\u3059\u3002\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
E_SLS_66000112 = \u30c7\u30fc\u30bf\u306e\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
I_SLS_06000106 = \u30c7\u30fc\u30bf\u306e\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u51e6\u7406\u3092\u5b9f\u884c\u3057\u307e\u3057\u305f\u3002
I_SLS_06000101 = \u30c7\u30fc\u30bf\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u307e\u3059\u3002\u3088\u308d\u3057\u3044\u3067\u3059\u304b\u3002
E_SLS_66000107 = \u5fc5\u9808\u9805\u76ee\u30c1\u30a7\u30c3\u30af\u3067\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3057\u305f\u3002
E_SLS_66000108 = \u55b6\u696d\u65e5\u30c1\u30a7\u30c3\u30af\u3067\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3057\u305f\u3002
E_SLS_66000109 = \u76f8\u95a2\u30c1\u30a7\u30c3\u30af\u3067\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3057\u305f\u3002
E_SLS_66000110 = \u91d1\u7a2eID\u30c1\u30a7\u30c3\u30af\u3067\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3057\u305f\u3002
E_SLS_66000111 = \u8cb8\u501f\u30c1\u30a7\u30c3\u30af\u3067\u30a8\u30e9\u30fc\u3068\u306a\u308a\u307e\u3057\u305f\u3002
E_SLS_66000140 = \u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

E_SLS_66000176=The file format is not correct.
E_SLS_66000177=Transaction data file is not correct.
E_SLS_66000178=It is not JSON format.
E_SLS_66000179=It becomes error in integrity check.
E_SLS_66000180=It becomes error in input check.

E_SLS_66000148=If cash register No. is entered, please always input store code.
E_SLS_66000149=Target data of sales payoff integrity check does not exist.
E_SLS_66000181=It becomes error in not null item check. Sales transaction id is {0}.
E_SLS_66000182=It becomes error in business date check. Sales transaction id is {0}.
E_SLS_66000183=It becomes error in correlation check. Sales transaction id is {0}.
E_SLS_66000184=It becomes error in tender id check. Sales transaction id is {0}.
E_SLS_66000185=It becomes error in total amount check. Sales transaction id is {0}.

E_SLS_66000140 = \u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
